{
  "SignUpPage": {
    "title": "Регистрация",
    "name": "Имя",
    "email": "Почта",
    "password": "Пароль",
    "passwordConf": "Подтвердить пароль",
    "btnName": "Регистрация",
    "question": "Уже существует аккаунт?",
    "btnBottomName": "Логин",
    "agreementsCheckText": "Я согласен(а) с <link1>Условиями предоставления услуг</link1> и <link2>Политикой конфиденциальности</link2>",
    "sentEmailConfirm": "Мы отправили ссылку для подтверждения на почту:",
    "emailExist": "Пользователь с такой почтой уже существует"
  },
  "SignInPage": {
    "title": "Логин",
    "email": "Почта",
    "password": "Пароль",
    "forgotPass": "Забыли пароль?",
    "btnName": "Логин",
    "question": "Нет аккаунта?",
    "btnBottomName": "Регистрация"
  },
  "VerificationInvalidPage": {
    "title": "Ссылка для подтверждения почты недействительна",
    "desc": "Похоже, срок действия ссылки для подтверждения истек. Не волнуйтесь, мы можем отправить ссылку еще раз",
    "btnName": "Отправить повторно"
  },
  "EmailExpiredPage": {
    "title": "Срок действия ссылки для подтверждения электронной почты истек",
    "desc": "Похоже, срок действия ссылки для подтверждения истек. Не волнуйтесь, мы можем отправить ссылку еще раз",
    "btnName": "Повторно отправить"
  },
  "EmailVerificationPage": {
    "title": "Поздравляем!",
    "desc": "Ваша почта была подтверждена успешно",
    "btnName": "Логин"
  },
  "ForgotPasswordPage": {
    "title": "Восстановление пароля",
    "email": "Почта",
    "desc": "Введите адрес электронной почты, и мы вышлем вам дальнейшие инструкции",
    "btnName": "Отправить ссылку",
    "linkName": "Логин",
    "descAfterSend": "Ссылка отправлена по электронной почте. Если вы не получили ссылку для отправки по электронной почте еще раз",
    "btnNameAfterSend": "Отправить ссылку еще раз",
    "modal": "Мы отправили ссылку для подтверждения почты на",
    "error400": "Неверные входные данные или капчи",
    "errorCode": "Бро, не забывай про капчу"
  },
  "MergerOfAccountsPage": {
    "title": "Объединение учетных записей",
    "descBefore": "Пользователь с электронной почтой",
    "descAfter": "уже есть в системе. Можем ли мы объединить эти аккаунты?",
    "btnNameYes": "Да, объединить",
    "btnNameNo": "Нет"
  },
  "RecoveryPage": {
    "title": "Создать новый пароль",
    "password": "Пароль",
    "passwordConf": "Подтвердите пароль",
    "desc": "Ваш пароль должен быть от 6 до 20 символов",
    "btnName": "Создать пароль",
    "errorCode": "Произошла ошибка. Попробуйте снова",
    "newPasswordSuccess": "Вы успешно сменили пароль"
  },
  "RegistrationConfirmationPage": {
    "title": "Поздравляем!",
    "desc": "Ваша почта была подтверждена успешно",
    "btnName": "Логин"
  },
  "NotFoundPage": {
    "title": "Страница не найдена",
    "description": "Пожалуйста, дважды проверьте адресную строку браузера или используйте навигацию, чтобы перейти на известную страницу"
  },
  "LocaleLayout": {
    "title": "next-intl example"
  },
  "MyProfilePage": {
    "subscriptions": "Подписки",
    "subscribers": "Подписчики",
    "publications": "Публикации",
    "btnName": "Настройки профиля",
    "btnSendMessage": "Написать сообщение",
    "aboutMe": "Заполните информацию о себе, сейчас здесь пусто",
    "noPosts": "У вас пока нет публикаций 😢",
    "SubscribersModal": {
      "title": "Подписчиков",
      "search": "Поиск",
      "subBtn": "Подписаться",
      "deleteBtn": "Удалить"
    },
    "SubscriptionsModal": {
      "title": "Подписок",
      "search": "Поиск",
      "unsubscribe": "Отписаться"
    },
    "UnsubscribeModal": {
      "title": "Отписаться",
      "question": "Вы действительно хотите отписаться от пользователя",
      "btnYes": "Да",
      "btnNo": "Нет"
    },
    "DeleteModal": {
      "title": "Удалить подписчика",
      "question": "Вы действительно хотите удалить подписчика",
      "btnYes": "Да",
      "btnNo": "Нет"
    },
    "DeleteAvatarModal": {
      "title": "Удалить фото профиля",
      "question": "Вы действительно хотите удалить фото профиля",
      "btnYes": "Да",
      "btnNo": "Нет"
    },
    "CreatePostModal": {
      "title": "Добавить фото"
    }
  },
  "Navigation": {
    "home": "Главная",
    "create": "Создать",
    "myProfile": "Мой профиль",
    "messenger": "Мессенджер",
    "search": "Поиск",
    "favourites": "Избранное",
    "statistics": "Статистика",
    "userslist": "Пользователи",
    "paymentslist": "Оплаты",
    "postslist": "Посты",
    "logout": "Выйти",
    "LogoutModal": {
      "title": "Выход",
      "question": "Вы действительно хотите выйти из своей учетной записи ",
      "btnYes": "Да",
      "btnNo": "Нет"
    },
    "logoutSuccess": "Вы успешно вышли",
    "logoutError": "Выход не выполнен"
  },
  "SettingsProfilePage": {
    "AdminGeneralInformationTab": {
      "titleTab": "Загруженные фото"
    },
    "AdminDevicesTab": {
      "titleTab": "Оплаты"
    },
    "AdminAccountManagementTab": {
      "titleTab": "Подписки"
    },
    "AdminMyPaymentsTab": {
      "titleTab": "Подписчики"
    },
    "GeneralInformationTab": {
      "titleTab": "Общая информация",
      "username": "Логин",
      "firstname": "Имя",
      "lastname": "Фамилия",
      "birthday": "Дата рождения",
      "country": "Выберите Вашу страну",
      "city": "Выберите Ваш город",
      "aboutMe": "Обо мне",
      "addBtn": "Добавить фото",
      "saveBtn": "Сохранить",
      "avatarSuccessfullyUploaded": "Аватар успешно загружен",
      "avatarUploadFailed": "Ошибка загрузки аватара",
      "avatarSuccessfullyDeleted": "Аватар успешно удален",
      "avatarDeleteFailed": "Ошибка удаления аватара",
      "updateProfileSuccess": "Профиль успешно обновлен",
      "updateProfileError": "Ошибка обновления профайла, попробуйте позже",
      "updateProfileUserExist": "Пользователь с таким логином уже существует",
      "defaultCountry": "Страна",
      "defaultCity": "Город"
    },
    "SettingsFormSchema": {
      "userName": {
        "matches": "Недопустимые символы в имени пользователя",
        "min": "Имя пользователя должно содержать минимум 6 символов",
        "max": "Имя пользователя не должно превышать 30 символов",
        "required": "Имя пользователя обязательно для заполнения",
        "updateProfileUserExist": "Пользователь с таким логином уже существует"
      },
      "firstName": {
        "matches": "Имя может содержать только буквенные символы",
        "min": "Имя должно содержать минимум 1 символ",
        "max": "Имя не должно превышать 50 символов",
        "required": "Имя пользователя обязательно для заполнения"
      },
      "lastName": {
        "matches": "Фамилия пользователя может содержать только буквенные символы",
        "min": "Фамилия должна содержать минимум 1 символ",
        "max": "Фамилия не должна превышать 50 символов",
        "required": "Фамилия пользователя обязательна для заполнения"
      },
      "city": {
        "max": "Город не должен превышать 15 символов"
      },
      "aboutMe": {
        "matches": "Описание пользователя может содержать только буквенные символы, цифры и специальные символы",
        "min": "Минимум 1 символ",
        "max": "Поле о себе не должно превышать 200 символов"
      },
      "dateOfBirth": {
        "ageMore13": "Возраст пользователя должен быть больше 13 лет",
        "ageLess100": "Возраст пользователя должен быть менее 100 лет",
        "ageMessage": "Возраст пользователя должен быть от 13 до 100 лет"
      }
    },
    "DevicesTab": {
      "titleTab": "Устройства",
      "title": "Это устройство",
      "status": "Онлайн",
      "active": "Активные сессии",
      "text": "Вы еще не вошли в систему с других устройств",
      "allSession": "Завершите все сеансы",
      "currentDevice": "Текущее устройство",
      "AllSessionsClosed": "Все сессии закрыты",
      "sessionClosed": "Сессия закрыта",
      "lastVisit": "Последний визит",
      "browserName": "Имя браузера"
    },
    "AccountManagementTab": {
      "titleTab": "Управление",
      "AccountType": "Тип аккаунта",
      "SubscriptionCost": "Стоимость вашей подписки",
      "CurrentSubscription": "Текущая подписка",
      "CurrentSubscriptionStart": "Оформлена",
      "CurrentSubscriptionEnd": "Истекает",
      "AutoRenewal": "Автопродление",
      "Personal": "Персональный",
      "Business": "Бизнес",
      "Prefix": "за",
      "Success": "Успешно",
      "Error": "Ошибка",
      "Back": "Назад к оплате",
      "OK": "OK",
      "CurrentSubscriptionSuccess": "Оплата прошла успешно!",
      "CurrentSubscriptionError": "Оплата отклонена. Пожалуйста, обратитесь в поддержку",
      "SubscribePeriod": {
        "Day": "День",
        "Week": "Неделю",
        "Month": "Месяц"
      }
    },
    "MyPaymentsTab": {
      "titleTab": "Мои платежи",
      "DateOfPayment": "Дата платежа",
      "EndOfPayment": "Дата окончания подписки",
      "Price": "Цена",
      "Period": "Тип подписки",
      "Type": "Средство платежа"
    },
    "AddPhotoModal": {
      "title": "Добавить фото",
      "selectBtn": "Выбрать фото",
      "saveBtn": "Сохранить",
      "openDraftBtn": "Открыть черновик",
      "nextBtn": "Далее",
      "cropping": "Кадрирование",
      "close": "Закрыть",
      "yes": "Да",
      "no": "Нет",
      "areYouSureText": "Вы действительно хотите удалить публикацию?",
      "filters": "Фильтры",
      "sizeError": "Размер фото должен быть меньше 10 МБ!",
      "formatError": "Формат загружаемого фото должен быть PNG и JPEG",
      "tooltipText": "Этот функционал пока недоступен",
      "publication": "Публикация",
      "publish": "Опубликовать",
      "addPublicationDescriptions": "Добавление описаний публикаций",
      "description": "Описание",
      "publicationsCreated": "Публикация создана"
    }
  },
  "CreatePost": {
    "AddPhotoModal": {
      "title": "Добавить фото",
      "selectBtn": "Выбрать фото",
      "saveBtn": "Сохранить",
      "openDraftBtn": "Открыть черновик",
      "nextBtn": "Далее",
      "cropping": "Кадрирование",
      "close": "Закрыть",
      "yes": "Да",
      "no": "Сохранить черновик",
      "areYouSureText": "Вы действительно хотите закрыть создание публикации? Если закрыть то все будет удалено",
      "filters": "Фильтры",
      "sizeError": "Размер фото должен быть меньше 20 МБ!",
      "formatError": "Формат загружаемого фото должен быть PNG и JPEG",
      "tooltipText": "Этот функционал пока недоступен",
      "errorValidFormat": "Формат загруженной фотографии должен быть PNG или JPEG",
      "errorValidSize": "Размер фотографии должен быть меньше",
      "error": "Ошибка!"
    },
    "EditPost": {
      "title": "Закрыть сообщение",
      "editModalText": "Вы действительно хотите закрыть редакцию поста? \nЕсли вы закроете изменения не сохранятся",
      "submit": "Да",
      "cancel": "Нет",
      "Сancel": "Закрыть",
      "editPost": "Редактировать публикацию",
      "deletePost": "Удалить публикацию",
      "addComment": "Добавить комментарий",
      "publish": "Опубликовать",
      "addPublicationDescriptions": "Добавить описание публикации",
      "saveChanges": "Сохранить",
      "save": "Сохранить",
      "viewComments": "Просмотреть все комментарии"
    },
    "DeletePostModal": {
      "title": "Удаление поста",
      "areYouSureText": "Вы действительно хотите удалить публикацию?",
      "yes": "Да",
      "no": "Нет",
      "close": "Закрыть"
    }
  },
  "AgreementsPage": {
    "btnName": "Назад к регистрации",
    "btnName1": "Назад к общей информации",
    "TermsOfService": {
      "title": "Условия предоставления услуг",
      "text": "Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. "
    },
    "PrivacyPolicy": {
      "title": "Политика конфиденциальности",
      "text": "Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. Тут сейчас много важного текста который говорит о том что ты соглашаешься на все подряд, разные согласия, много разных слов, все выглядит очень серьезно, все хорошо. "
    }
  },
  "Errors": {
    "userName": {
      "required": "Имя пользователя обязательно",
      "min": "Имя пользователя должно быть не менее 6 символов",
      "max": "Имя пользователя не должно превышать 30 символов",
      "spaces": "Имя не должен содержать пробелов",
      "invalidCharacters": "Имя пользователя должно содержать a-z, A-Z, 1-9",
      "nameExist": "Пользователь с таким именем пользователя уже зарегистрирован"
    },
    "email": {
      "required": "Email обязателен",
      "email": "Неверный формат email",
      "invalidCharacters": "Email должен содержать a-z, A-Z, ., @",
      "spaces": "Почта не должена содержать пробелов"
    },
    "password": {
      "required": "Пароль обязателен",
      "min": "Пароль должен быть не менее 6 символов",
      "max": "Пароль не должен превышать 20 символов",
      "spaces": "Пароль не должен содержать пробелов",
      "invalidCharacters": "Пароль может содержать латиницу и спец символы",
      "complexity": "Пароль должен содержать 0-9, a-z, A-Z"
    },
    "passwordConfirm": {
      "required": "Подтверждение пароля обязательно",
      "min": "Подтверждение должно быть не менее 6 символов",
      "oneOf": "Пароли не совпадают"
    },
    "agreements": {
      "required": "Вы должны принять соглашения"
    },
    "login": {
      "error400": "Неверный адрес электронной почты или пароль. Пожалуйста, попробуйте снова",
      "error401": "Этот адрес электронной почты не зарегистрирован",
      "errorundefined": "Что-то пошло не так, пожалуйста, попробуйте позже"
    },
    "common": {
      "error": "Ошибка!"
    }
  },
  "Time": {
    "now": "Только что",
    "minutes": {
      "many": "минут назад",
      "one": "минуту назад",
      "few": "минуты назад"
    },
    "hours": {
      "many": "часов назад",
      "one": "час назад",
      "few": "часа назад"
    },
    "days": {
      "many": "дней назад",
      "one": "день назад",
      "few": "дня назад"
    },
    "months": {
      "many": "месяцев назад",
      "one": "месяц назад",
      "few": "месяца назад"
    },
    "years": {
      "many": "лет назад",
      "one": "год назад",
      "few": "года назад"
    }
  },
  "Header": {
    "notifications": {
      "notZeroNotifications": "Уведомления",
      "zeroNotifications": "У Вас пока нет уведомлений",
      "newNotifications": "Новое уведомление!",
      "logIn": "Войти",
      "signUp": "Регистрация"
    },
    "mobileMenu": {
      "profileSettings": "Настройки профиля",
      "statistics": "Статистика",
      "favourites": "Избранное",
      "logOut": "Выйти"
    }
  },
  "CounterRegisterUser": {
    "RegisterUsers": "Регистрация пользователей"
  },
  "ReadMore": {
    "showMore": "Показать больше",
    "hide": "Скрыть"
  },
  "Admin": {
    "id": "ID Пользователя",
    "username": "Имя Пользователя",
    "profile-link": "Профиль",
    "createdBy": "Дата создания",
    "Userlist": {
      "deleteUser": "Удалить пользователя",
      "ban": "Бан в системе",
      "moreInfo": "Больше информации"
    },
    "selectFilter": {
      "blocked": "Заблокированные",
      "choose": "Не выбрано",
      "unBlocked": "Не заблокированые"
    },
    "userlistModals": {
      "unBanUser": {
        "close": "Разбанить пользователя",
        "areYouSureText": "Вы действительно хотите разбанить пользователя,",
        "yes": "Да",
        "no": "Нет"
      },
      "banUser": {
        "close": "Забанить пользователя",
        "areYouSureText": "Вы действительно хотите забанить пользователя,",
        "select": {
          "anotherReason": "Другая причина",
          "choose": "Причина бана",
          "behavioue": "Плохое поведение",
          "placement": "Реклама"
        },

        "yes": "Да",
        "no": "Нет"
      },
      "deleteUser": {
        "close": "Удалить пользователя",
        "areYouSureText": "Вы действительно хотите удалить пользователя",
        "yes": "Да",
        "no": "Нет"
      }
    },
    "paypentlist": {
      "createdAt": "Дата покупки",
      "userName": "Имя пользователя",
      "price": "Стоимость,$",
      "period": "Тип подписки",
      "type": "Тип подписки",
      "paymentType": "Тип оплаты",
      "endDate": "Конец подписки",
      "startDate": "Начало подписки",
      "userId": "ID Пользователя",
      "userIdFollowers": "Профиль",
      "createdAtFollowers": "Подписан"
    }
  },
  "HomePostPopup": {
    "report": "Пожаловаться",
    "follow": "Подписаться",
    "unfollow": "Отписаться",
    "copy": "Копировать ссылку",
    "delete": "Удалить пост"
  },
  "PaginationSelect": {
    "show": "Показать",
    "onThePage": "на странице"
  }
}
